<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<title>swr8bit</title>
	<link rel="stylesheet" href="style.css"> 
</head>
<body>

<div class="content">
	
		<?php
			include	"header.php";
		?>
	    
    <div class="contentWrap">
            <div class="content">
                <div class="center">
	
	                <h1><i>swr8bit</i>. Лог создания сайта</h1>

		            <div class="box">
                        <p><b></b></p>
                        <p><b>26.05</b> <br>- В раздел "Ссылки и файлы" добавлены мои сертификаты GeekBrains.</p>
                        <p><b>25.06</b> <br>- Добавлен "Генератор пароля". На странице 2 реализации: с помощью PHP и javascript.<br>- Добавлена страничка лога.<br>- Добавлена страничка "Ссылки и файлы".<br>- Правка стилей для правильного отображения.</p>
                        <p><b>24.06</b> <br>- "Угадай число" теперь для двух пользователей, предлагается игрокам выбрать число попыток и представиться.<br>- Кнопка "Играть с друзьями" запускает альтернативную версию игры в виде скрипта, где также можно указать количество игроков.</p>
                        <p><b>23.06</b> <br>- Перевод всех страниц в PHP.<br>- Карта сайта выведена в отдельный файл.<br>- Добавлена упрощенная реализация "Загадок" на PHP.<br>- Добавлена игра "Угадай число" на javascript.</p>
                        <p><b>23.06</b> <br>- В игре "Загадки" реализовано рандомное отображение 3 загадок из 5 имеющхся в массиве при обновлении страницы.<br>- Добавлена кнопка "Заново", обновляющая страницу.<br>- Хостинг сайта.</p>
                        <p><b>22.06</b> <br>- Добавлена игра "Загадки" и "Калькулятор суммы вклада" на javascript.</p>
                        <p><b>22.06</b> <br>- Создание сайта, чистый HTML. Главная страница, фото, стили.</p>
                    
                    </div>
                </div>
		    </div>
	</div>
</div>
<div class="footer">
&copy; swr8bit	<?php echo date("Y");?>
</div>


</body>
</html>